; domain
(define (domain hanoi)
(:requirements :strips)
(:predicates (clear ?x)
             (on ?x ?y)
             (smaller ?x ?y))

(:action move
:parameters (?disc ?from ?to)
:precondition (and (smaller ?disc ?to) 
                   (on ?disc ?from) 
                   (clear ?disc) 
                   (clear ?to))
:effect  (and (clear ?from) 
              (on ?disc ?to) 
              (not (on ?disc ?from))  
              (not (clear ?to)))
 ))

; problem
(define (problem hanoi1)
    (:domain hanoi)
    (:objects
        peg1
        peg2
        peg3
        green_disk
        blue_disk
        red_disk
    )
    (:init
        (clear green_disk)
        (clear peg2)
        (clear peg3)
        (on green_disk blue_disk)
        (on blue_disk red_disk)
        (on red_disk peg1)
        (smaller green_disk blue_disk)
        (smaller green_disk red_disk)
        (smaller blue_disk red_disk)
        (smaller green_disk peg1)
        (smaller green_disk peg2)
        (smaller green_disk peg3)
        (smaller blue_disk peg1)
        (smaller blue_disk peg2)
        (smaller blue_disk peg3)
        (smaller red_disk peg1)
        (smaller red_disk peg2)
        (smaller red_disk peg3)
    )
    (:goal (and 
        (on red_disk peg3) 
        (on blue_disk red_disk) 
        (on green_disk blue_disk)
    ))
)

; plan
1. (move green_disk blue_disk peg3)
   deleted: (on green_disk blue_disk) (clear peg3)
   added: (clear blue_disk) (on green_disk peg3)
   goals met: 1 of 3
2. (move blue_disk red_disk peg2)
   deleted: (on blue_disk red_disk) (clear peg2)
   added: (clear red_disk) (on blue_disk peg2)
   goals met: 0 of 3
3. (move green_disk peg3 blue_disk)
   deleted: (on green_disk peg3) (clear blue_disk)
   added: (clear peg3) (on green_disk blue_disk)
   goals met: 1 of 3
4. (move red_disk peg1 peg3)
   deleted: (on red_disk peg1) (clear peg3)
   added: (clear peg1) (on red_disk peg3)
   goals met: 2 of 3
5. (move green_disk blue_disk peg1)
   deleted: (on green_disk blue_disk) (clear peg1)
   added: (clear blue_disk) (on green_disk peg1)
   goals met: 1 of 3
6. (move blue_disk peg2 red_disk)
   deleted: (on blue_disk peg2) (clear red_disk)
   added: (clear peg2) (on blue_disk red_disk)
   goals met: 2 of 3
7. (move green_disk peg1 blue_disk)
   deleted: (on green_disk peg1) (clear blue_disk)
   added: (clear peg1) (on green_disk blue_disk)
   goals met: 3 of 3
